"use strict";
console.log("Hello world");

// Задача-1
// Напишіть функцію яка приймає два параметри str1 та str2.Функція повинна повернути булеве значення true якщо перша літера
// str1 дорівнює останій літері str2.В іншому випадку функція повинна повернути булеве значення false.

// function indexLetter(str1, str2) {
//   const letterStr1 = str1[0];
//   const letterStr2 = str2[str2.length - 1];
//   return letterStr1 === letterStr2;
// }

// const res = indexLetter("try", "try");
// console.log(res);

// Задача-2
// Напишіть функцію яка приймає два параметри str1 та str2.Функція повинна повернути булеве значення true якщо перша літера
// str1 дорівнює першій літері str2.В іншому випадку функція повинна повернути булеве значення false.

// function indexLetter(str1, str2) {
//   return str1[0] === str2[0];
// }

// const res = indexLetter("try", "try");
// console.log(res);

// Задача-3
// Напишіть функцію яка приймає два параметри str1 та str2.Функція повинна повернути булеве значення true якщо довжина str1
// дорівнює довжині str2.В іншому випадку функція повинна повернути булеве значення false.

// function lengthString(str1, str2) {
//   return str1.length === str2.length;
// }

// const res1 = lengthString("Try", "Try");
// const res2 = lengthString("Try", "Catch");
// console.log(res1);
// console.log(res2);

// Задача-4
// Напишіть функцію яка приймає число num.Функція повинна повернути булеве значення true якщо кількість цифр у числі парна.
// В іншому випадку функція повинна повернути булеве значення false.

// function foo(num) {
//   return num % 2 === 0;
// }

// const res1 = foo(22);
// console.log(res1);

// Задача-5
// Напишіть функцію, яка приймає два параметри num1 та num2.Функція повинна повернути булеве значення true, якщо num1 більше,
// ніж num2.В іншому випадку функція повинна повернути булеве значення false.

// function foo(num1, num2) {
//   return num1 > num2;
// }

// const res1 = foo(22, 22);
// console.log(res1);
// const res2 = foo(22, 20);
// console.log(res2);

// Задача-6
// Напишіть функцію, яка приймає два параметри num1 та num2.Функція повинна повернути булеве значення true, якщо num1 ділиться
// на num2 без остачі.В іншому випадку функція повинна повернути булеве значення false.

// function foo(num1, num2) {
//   return num1 % num2 === 0;
// }

// const res1 = foo(10, 5);
// const res2 = foo(15, 7);
// console.log(res1);
// console.log(res2);

// Задача-7
// Напишіть функцію, яка приймає число num.Функція повинна повернути булеве значення true, якщо num є непарним числом.В іншому
// випадку функція повинна повернути булеве значення false.

// function foo(num) {
//   return num % 2 === 0;
// }

// const res1 = foo(9);
// console.log(res1);
// const res2 = foo(4);
// console.log(res2);

// Задача-8
// Напишіть функцію, яка приймає параметр str.Функція повинна повернути булеве значення true, якщо str містить принаймні одну
// велику літеру.В іншому випадку функція повинна повернути булеве значення false.
// Підказка: допоможе toLowerCase();

// function foo(str) {
//   return str === str.toLowerCase();
// }

// const res1 = foo("try");
// console.log(res1);
// const res2 = foo("Tree");
// console.log(res2);

// Задача-9
// Напишіть функцію, яка приймає два параметри str1 та str2.Функція повинна повернути булеве значення true, якщо довжина str1
// більше, ніж довжина str2.В іншому випадку функція повинна повернути булеве значення false.

// function lengthString(str1, str2) {
//   const lenStr = str1.length > str2.length;
//   return lenStr;
// }

// const res1 = lengthString("Try", "Tree");
// console.log(res1);
// const res2 = lengthString("Tree", "Try");
// console.log(res2);

// Задача-12
// Напишіть функцію, яка приймає рядок str.Функція повинна повернути булеве значення true, якщо str містить хоча б один пробіл.
// В іншому випадку функція повинна повернути булеве значення false.

// function foo(str) {
//   return str.includes(" ");
// }

// const res1 = foo("Try tree");
// console.log(res1);
// const res2 = foo("Try");
// console.log(res2);

// Задача-14
// Напишіть функцію, яка приймає рядок str.Функція повинна повернути булеве значення true, якщо str є паліндромом(однаковий
// у зворотному напрямку).В іншому випадку функція повинна повернути булеве значення false.

// Підказка: тут допоможе метод масиву reverse();

// Задача-15
// Напишіть функцію, яка приймає два параметри num1 та num2.Функція повинна повернути булеве значення true, якщо num1 менше
// або дорівнює num2.В іншому випадку функція повинна повернути булеве значення false.

// Задача-17
// Напишіть функцію, яка приймає рядок str.Функція повинна повернути булеве значення true, якщо перша літера str є голосною
// (a, e, i, o, u).В іншому випадку функція повинна повернути булеве значення false.

// Задача-19
// Напишіть функцію, яка приймає два параметри num1 та num2.Функція повинна повернути булеве значення true, якщо num1 і num2
// рівні.В іншому випадку функція повинна повернути булеве значення false.

// Задача-20
// Напишіть функцію, яка приймає число num.Функція повинна повернути булеве значення true, якщо num більше або дорівнює нулю.
// В іншому випадку функція повинна повернути булеве значення false.

// Задача-21
// Напишіть функцію, яка приймає рядок str.Функція повинна повернути булеве значення true, якщо довжина str є парною.В іншому
// випадку функція повинна повернути булеве значення false.

// Задача-22
// Напишіть функцію, яка приймає два параметри num1 та num2.Функція повинна повернути булеве значення true, якщо num1 ділиться
// на 2, а num2 не ділиться на 2. В іншому випадку функція повинна повернути булеве значення false.

// Задача-23
// Напишіть функцію, яка приймає число num.Функція повинна повернути булеве значення true, якщо num більше 100, але менше 200.
// В іншому випадку функція повинна повернути булеве значення false.

// Задача-24
// Напишіть функцію, яка приймає рядок str.Функція повинна повернути булеве значення true, якщо str містить лише маленькі літери.
// В іншому випадку функція повинна повернути булеве значення false.
// Підказка: допоможе toLowerCase();

// Задача-25
// Напишіть функцію, яка приймає два параметри str1 та str2.Функція повинна повернути булеве значення true, якщо str1 є частиною
// str2.В іншому випадку функція повинна повернути булеве значення false.

// Задача-26
// Напишіть функцію, яка приймає число num.Функція повинна повернути булеве значення true, якщо num є негативним числом.В
// іншому випадку функція повинна повернути булеве значення false.

// Задача-27
// Напишіть функцію, яка приймає два параметри num1 та num2.Функція повинна повернути булеве значення true, якщо різниця між
// num1 та num2 більше 50. В іншому випадку функція повинна повернути булеве значення false.

// Задача-28
// Напишіть функцію, яка приймає число num.Функція повинна повернути булеве значення true, якщо num є нуль.В іншому випадку
// функція повинна повернути булеве значення false.

// Задача-29
// Напишіть функцію, яка приймає два параметри str1 та str2.Функція повинна повернути булеве значення true, якщо остання
// літера str1 є голосною(a, e, i, o, u).В іншому випадку функція повинна повернути булеве значення false.

// Задача-30
// Напишіть функцію, яка приймає число num.Функція повинна повернути булеве значення true, якщо num є кратним 10. В іншому
// випадку функція повинна повернути булеве значення false.
