"use strict";
// console.log("Hello, world");

// # Масиви та методи рядкочків

// 1. Напиши цикл, який виведе на консоль числа від 1 до 10.

// for (let i = 1; i <= 10; i += 1) {
//   console.log(i);
// }

// 1. Напиши цикл, який виведе на консоль парні числа від 1 до 20.

// for (let i = 1; i <= 20; i += 1) {
//   if (i % 2 === 0) {
//     console.log(i);
//   }
// }

// 1. Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.

// function calculateTotalPrice(order) {
//   let sumOrder = 0;
//   for (const element of order) {
//     sumOrder += element;
//   }
//   return sumOrder;
// }

// let sum = 0;
// for (let i = 1; i <= 100; i += 1) {
//   sum += i;
//   // console.log(sum);
// }
// console.log(sum);

// 1. Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до
//    10).
// 1. Напиши цикл, який обчислить факторіал числа, введеного користувачем
//    (наприклад, факторіал числа 5: `!5 = 1 * 2 * 3 * 4 * 5`).

// 1. Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"
// 1. Напиши цикл, який виведе кожну літеру рядочку "Hello world" у зворотньому
//    порядку.
// 1. Напиши цикл, який виведе кожну літеру рядочку "Hello world" поки не зустріне
//    пробіл.
// 1. Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".

// 1. Напиши функцію, яка приймає рядок та повертає перевернутий рядок
// 1. Напиши функцію, яка приймає рядок та повертає рядок де кожен другий символ у
//    верхньому регістрі
// 1. Напиши функцію getString(str1, str2, count). Функція повинна додати str2 до
//    рядочка str1 стільки разів скільки вказали у параметрі count.
